lib/branston/app/controllers/iterations_controller.rb

SELECT * FROM "iterations"
---
  def index
    @iterations = Iteration.all

SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)
---
  def show
    @iteration = Iteration.find(params[:id])

SELECT * FROM "releases"
---
  def new
    @releases = Release.all

SELECT * FROM "releases"
SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)
---
  def edit
    @releases = Release.all
    @iteration = Iteration.find(params[:id])

INSERT INTO "iterations" ("name", "start_date", "created_at", "updated_at", "release_id", "velocity", "end_date") VALUES('Iteration 1', '2009-12-16 16:53:00', '2009-12-03 16:53:31', '2009-12-03 16:53:31', 1, 4, '2009-12-31 16:53:00')
SELECT * FROM "releases"
---
  def create
    @iteration = Iteration.new(params[:iteration])

    respond_to do |format|
      if @iteration.save
        flash[:notice] = 'Iteration was successfully created.'
        format.html { redirect_to iterations_path }
        format.xml  { render :xml => @iteration, :status => :created, :location => @iteration }
      else
        @releases = Release.all

SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)
UPDATE "iterations" SET "updated_at" = '2009-12-03 13:41:29', "release_id" = 1, "end_date" = '2009-12-03 15:06:00' WHERE "id" = 1
SELECT * FROM "releases"
---
  def update
    @iteration = Iteration.find(params[:id])

    respond_to do |format|
      if @iteration.update_attributes(params[:iteration])
        flash[:notice] = 'Iteration was successfully updated.'
        format.html { redirect_to iterations_path }
        format.xml  { head :ok }
      else
        @releases = Release.all

SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)
DELETE FROM "iterations" WHERE "id" = 1
---
  def destroy
    @iteration = Iteration.find(params[:id])
    @iteration.destroy