lib/branston/app/controllers/outcomes_controller.rb

SELECT * FROM "outcomes" WHERE ("outcomes"."id" = 1)
---
  def show
    @outcome = Outcome.find(params[:id])

SELECT * FROM "outcomes" WHERE ("outcomes"."id" = 1)
---
  def edit
    @outcome = Outcome.find(params[:id])

INSERT INTO "outcomes" ("scenario_id", "created_at", "updated_at", "description") VALUES(5, '2009-12-03 18:04:02', '2009-12-03 18:04:02', 'your momma so fat...')
---
  def create
    @outcome = Outcome.new(params[:outcome])
    @outcome.scenario = @scenario
    @outcomes = @scenario.outcomes
    respond_to do |format|
      if @outcome.save

SELECT * FROM "outcomes" WHERE ("outcomes"."id" = 1)
UPDATE "outcomes" SET "updated_at" = '2009-12-04 12:12:10', "description" = 'bar' WHERE "id" = 1
---
  def update
    @outcome = Outcome.find(params[:id])

    respond_to do |format|
      if @outcome.update_attributes(params[:outcome])

SELECT * FROM "outcomes" WHERE ("outcomes"."id" = 1)
DELETE FROM "outcomes" WHERE "id" = 1
---
  def destroy
    @outcome = Outcome.find(params[:id])
    @outcome.destroy

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 5)
---
  def find_scenario
    @scenario = Scenario.find(params[:scenario_id])