lib/branston/app/controllers/preconditions_controller.rb

  def show
    @precondition = Precondition.find(params[:id])
---
SELECT * FROM "preconditions" WHERE ("preconditions"."id" = 1)

  def edit
    @precondition = Precondition.find(params[:id])
---
SELECT * FROM "preconditions" WHERE ("preconditions"."id" = 1)

  def create
    @precondition = Precondition.new(params[:precondition])
    @precondition.scenario = @scenario
    @preconditions = @scenario.preconditions
    respond_to do |format|
      if @precondition.save
---
INSERT INTO "preconditions" ("scenario_id", "created_at", "updated_at", "description") VALUES(1, '2009-12-04 15:39:05', '2009-12-04 15:39:05', 'The user is using the website

  def update
    @precondition = Precondition.find(params[:id])

    respond_to do |format|
      if @precondition.update_attributes(params[:precondition])
---
SELECT * FROM "preconditions" WHERE ("preconditions"."id" = 1)
UPDATE "preconditions" SET "updated_at" = '2009-12-04 12:12:11', "description" = 'Bar' WHERE "id" = 1

  def destroy
    @precondition = Precondition.find(params[:id])
    @precondition.destroy
---
SELECT * FROM "preconditions" WHERE ("preconditions"."id" = 1)
DELETE FROM "preconditions" WHERE "id" = 1

  def find_scenario
    @scenario = Scenario.find(params[:scenario_id]) if @scenario.nil?
---
SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1)