lib/branston/app/controllers/releases_controller.rb

SELECT * FROM "releases"
---
  def index
    @releases = Release.all

SELECT * FROM "releases" WHERE ("releases"."id" = 1)
---
  def show
    @release = Release.find(params[:id])

SELECT * FROM "releases" WHERE ("releases"."id" = 1)
---
  def edit
    @release = Release.find(params[:id])

INSERT INTO "releases" ("created_at", "notes", "updated_at", "release_date") VALUES('2009-12-03 12:59:00', 'Aliquam erat volutpat. Quisque convallis; dui semper sagittis venenatis, ligula sapien aliquam nunc, sit amet convallis orci dui ac magna! In mollis sollicitudin lacus, vel pulvinar enim scelerisque id. Fusce lacus orci, bibendum et porta aliquet, posuere eu sem. Donec a tortor erat, mattis pellentesque ligula. Morbi vulputate malesuada diam, in luctus justo aliquam in. Aenean adipiscing lectus sit amet magna tristique hendrerit. Sed sit amet purus sapien? Suspendisse bibendum arcu congue purus iaculis vehicula eget at nisl. Fusce massa risus, tincidunt vitae fringilla vel, pellentesque vel lacus. Sed tempor luctus vestibulum. Phasellus sit amet leo tortor. In vulputate felis sit amet dolor faucibus non scelerisque metus ullamcorper. Sed fringilla vestibulum porta. Vivamus eget purus amet.
---
  def create
    @release = Release.new(params[:release])

    respond_to do |format|
      if @release.save

SELECT * FROM "releases" WHERE ("releases"."id" = 1)
UPDATE "releases" SET "updated_at" = '2009-12-04 12:12:11', "notes" = '---
---
  def update
    @release = Release.find(params[:id])

    respond_to do |format|
      if @release.update_attributes(params[:release])

SELECT * FROM "releases" WHERE ("releases"."id" = 1)
DELETE FROM "releases" WHERE "id" = 1
---
  def destroy
    @release = Release.find(params[:id])
    @release.destroy