lib/branston/app/controllers/scenarios_controller.rb

  def show
    @scenario = Scenario.find(params[:id])
---
SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1)

  def edit
    @scenario = Scenario.find(params[:id])
---
SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1)

  def create
    @scenario = Scenario.new(params[:scenario])
    @scenario.story = @story
    respond_to do |format|
      if @scenario.save
---
INSERT INTO "scenarios" ("created_at", "title", "updated_at", "story_id") VALUES('2009-12-03 12:46:51', 'Should validate me', '2009-12-03 12:46:51', 4)

  def update
    @scenario = Scenario.find(params[:id])
    respond_to do |format|
      if @scenario.update_attributes(params[:scenario])
---
SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1)
UPDATE "scenarios" SET "updated_at" = '2009-12-04 12:12:12', "title" = 'Bar' WHERE "id" = 1

  def destroy
    @scenario = Scenario.find(params[:id])
    @scenario.destroy
---
SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 3)
DELETE FROM "scenarios" WHERE "id" = 3

  def find_story
    @story = Story.find(params[:story_id]) if @story.nil?
---
SELECT * FROM "stories" WHERE ("stories"."id" = 4)