lib/branston/app/controllers/stories_controller.rb

  def generate_feature
    @story = Story.find(params[:id], :include => :scenarios)
---
SELECT "scenarios".* FROM "scenarios" WHERE ("scenarios".story_id = 1)
SELECT * FROM "stories" WHERE ("stories"."id" = 1)

  def index
    @current_stories = Story.in_progress
    @backlog_stories = Story.find :all, :conditions => "iteration_id IS NULL"
---
SELECT * FROM "stories" WHERE (iteration_id IS NOT NULL)

  def show
    @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)

  def edit
    @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)

  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("created_at", "title", "updated_at", "points", "description", "author_id", "iteration_id") VALUES('2009-12-02 11:56:34', 'Add A Winnet', '2009-12-02 11:56:34', 5, 'Fusce dolor dolor, mollis quis dictum et, pharetra tincidunt elit. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos himenaeos. Nunc dignissim, dolor at consequat viverra, nunc nisl congue purus; a aliquam libero augue sit amet lacus. Morbi faucibus gravida accumsan. Integer eros nunc, vehicula id tempus sed, fermentum tristique velit. Cras feugiat sapien massa. Duis aliquam, ipsum ac lobortis fermentum, enim augue varius neque, ac ornare nulla turpis in augue. Proin vulputate dictum justo a volutpat! Pellentesque ac justo est; vitae imperdiet quam. Mauris vitae nisl non lorem blandit tempor! Nulla lacinia, ipsum in tincidunt rhoncus, ligula massa feugiat orci, at ultrices metus arcu id metus? Integer eget nisi quis mauris dignissim dignissim. Donec volutpat.

  def update
    @story = Story.find(params[:id])
    respond_to do |format|
      if @story.update_attributes(params[:story])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)
UPDATE "stories" SET "updated_at" = '2009-12-02 12:34:48', "description" = 'Musce dolor dolor, mollis quis dictum et, pharetra tincidunt elit. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos himenaeos. Nunc dignissim, dolor at consequat viverra, nunc nisl congue purus; a aliquam libero augue sit amet lacus. Morbi faucibus gravida accumsan. Integer eros nunc, vehicula id tempus sed, fermentum tristique velit. Cras feugiat sapien massa. Duis aliquam, ipsum ac lobortis fermentum, enim augue varius neque, ac ornare nulla turpis in augue. Proin vulputate dictum justo a volutpat! Pellentesque ac justo est; vitae imperdiet quam. Mauris vitae nisl non lorem blandit tempor! Nulla lacinia, ipsum in tincidunt rhoncus, ligula massa feugiat orci, at ultrices metus arcu id metus? Integer eget nisi quis mauris dignissim dignissim. Donec volutpat.

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
SELECT * FROM "stories" WHERE ("stories"."id" = 1)
DELETE FROM "stories" WHERE "id" = 1