lib/branston/app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.state = "pending"
    if @user && @user.valid? && @user.save!
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '3e491a7b8181dfe6ec236330921e16ce073a2853', '2009-12-04 17:14:23', '8fcddd9aa84cb851af493711d9b767e6babca0ad', NULL, '2009-12-04 17:14:23', NULL, 'steve', 'steve.laing@gmail.com')