lib/branston/app/controllers/user_roles_controller.rb

  def index
    @user_roles = UserRole.all
---
SELECT * FROM "user_roles"

  def show
    @user_role = UserRole.find(params[:id])
---
SELECT * FROM "user_roles" WHERE ("user_roles"."id" = 1)

  def edit
    @user_role = UserRole.find(params[:id])
---
SELECT * FROM "user_roles" WHERE ("user_roles"."id" = 1)

  def create
    @user_role = UserRole.new(params[:user_role])

    respond_to do |format|
      if @user_role.save
---
INSERT INTO "user_roles" ("name", "created_at", "updated_at", "story_id") VALUES('customer', '2009-12-04 12:12:13', '2009-12-04 12:12:13', NULL)

  def update
    @user_role = UserRole.find(params[:id])

    respond_to do |format|
      if @user_role.update_attributes(params[:user_role])
---
SELECT * FROM "user_roles" WHERE ("user_roles"."id" = 1)
UPDATE "user_roles" SET "updated_at" = '2009-12-04 12:12:13', "name" = '---

  def destroy
    @user_role = UserRole.find(params[:id])
    @user_role.destroy
---
SELECT * FROM "user_roles" WHERE ("user_roles"."id" = 1)
DELETE FROM "user_roles" WHERE "id" = 1