app/controllers/iterations_controller.rb

  def index
    @iterations = Iteration.all
---
SELECT * FROM "iterations"

  def show
    @iteration = Iteration.find(params[:id])
---
SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)

  def new
    @releases = Release.all
---
SELECT * FROM "releases"

  def edit
    @releases = Release.all
    @iteration = Iteration.find(params[:id])
---
SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)

  def create
    @iteration = Iteration.new(params[:iteration])

    respond_to do |format|
      if @iteration.save
---
INSERT INTO "iterations" ("name", "start_date", "created_at", "updated_at", "release_id", "velocity", "end_date") VALUES('Test Iteration', '2011-04-11 18:42:00', '2011-04-12 17:42:35', '2011-04-12 17:42:35', NULL, 80, '2011-04-22 18:42:00')

  def update
    @iteration = Iteration.find(params[:id])

    respond_to do |format|
      if @iteration.update_attributes(params[:iteration])
---
SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)
UPDATE "iterations" SET "updated_at" = '2009-11-27 14:10:36', "name" = 'bar' WHERE "id" = 1

  def destroy
    @iteration = Iteration.find(params[:id])
    @iteration.destroy
---
SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)
DELETE FROM "iterations" WHERE "id" = 1