app/controllers/stories_controller.rb

  def index
    @current_stories = Story.for_iteration(@iteration.id).in_progress
    @backlog_stories = Story.for_iteration(@iteration.id).unassigned
    @quality_assurance_stories = Story.for_iteration(@iteration.id).in_quality_assurance
    @completed_stories = Story.for_iteration(@iteration.id).completed
    @total_assigned_points = 0

    Story.for_iteration(@iteration.id).map { |s|
---
SELECT * FROM "iterations"
SELECT * FROM "stories" WHERE ((status = "quality_assurance") AND (iteration_id = 1))

  def create
    @story = Story.new(params[:story])
    @story.author = current_user
    @story.iteration = @iteration

    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("slug", "created_at", "title", "completed_date", "updated_at", "points", "description", "author_id", "iteration_id", "status") VALUES('sed-pretium-mattis-velit-at-interdum-augue-posuere', '2011-04-12 17:42:55', 'Sed pretium mattis velit, at interdum augue posuere.', NULL, '2011-04-12 17:42:55', 4, 'Sed a semper lacus. Nam feugiat, lorem vel blandit pulvinar, leo ligula elementum mauris; eget placerat nibh elit eu risus. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aenean dictum elit nec ante cursus sit amet commodo orci suscipit. Morbi malesuada elementum nulla, vitae pulvinar nisi volutpat a. Ut vulputate ipsum eget augue aliquam eget luctus nisl imperdiet. Suspendisse tempor tempor nisl sit amet hendrerit. Nulla at lacus sit amet lorem laoreet dictum! sed.

  def update
    @story = Story.find_by_slug(params[:id])

    if params[:story] and params[:story][:status]
      @story.assign if params[:story][:status] == 'in_progress'
      @story.check_quality if params[:story][:status] == 'quality_assurance'
      @story.back_to_new if params[:story][:status] == 'new'
      @story.finish if params[:story][:status] == 'completed'
    end

    respond_to do |format|
      if @story.update_attributes(params[:story])
---
SELECT * FROM "stories" WHERE ("stories"."slug" = 'sed-pretium-mattis-velit-at-interdum-augue-posuere') LIMIT 1
UPDATE "stories" SET "updated_at" = '2011-04-12 17:43:39', "status" = 'completed', "completed_date" = '2011-04-12' WHERE "id" = 1

  def destroy
    @story = Story.find_by_slug(params[:id])
    @story.destroy
---
DELETE FROM "stories" WHERE "id" = 1

  def load_iteration
    @iteration = Iteration.find(params[:iteration_id])
---
SELECT * FROM "iterations" WHERE ("iterations"."id" = 1)