app/controllers/stories_controller.rb

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def show
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def edit
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def update
    @story = Story.find(params[:id])

SELECT * FROM "stories" WHERE ("stories"."id" = 1)
---
  def destroy
    @story = Story.find(params[:id])