app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '2b04b96bcc4682dd5b29752dc1e7c69cb95095c2', '2009-11-27 14:10:36', '37139ba0d04b5a64798bf7964e7faa8062dbbb86', NULL, '2009-11-27 14:10:36', NULL, 'quire', 'quire@example.com')
---
  def create
    @user = User.new(params[:user])
    @user.role = params[:user][:role] if current_user.has_role?("admin")
    if @user && @user.valid? && @user.save!